In [3]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data[0] = None

In [6]:
string_data.isnull() #查找缺失

0     True
1    False
2     True
3    False
dtype: bool

滤出缺失数据

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna() #过率缺失数据

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()] #过率缺失

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], 
 ....: [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna() #含有缺失值的行都丢弃
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all') #只丢弃全是 NaN 的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna(axis=1,)  #axis=1 丢弃列含有NAN

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
填充缺失数据

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.472434       NaN       NaN
1 -0.543109       NaN       NaN
2  2.102813       NaN  0.653686
3  0.403113       NaN -0.928956
4 -0.534830  1.170950 -3.050913
5  0.881881  0.922318 -0.715818
6 -0.682700  0.223867 -0.394087

In [17]:
df.fillna(0)#缺失值填充

          0         1         2
0  1.472434  0.000000  0.000000
1 -0.543109  0.000000  0.000000
2  2.102813  0.000000  0.653686
3  0.403113  0.000000 -0.928956
4 -0.534830  1.170950 -3.050913
5  0.881881  0.922318 -0.715818
6 -0.682700  0.223867 -0.394087

In [18]:
df.fillna({1:0,2:0.5}) #字典调用 不同列填充不同值

          0         1         2
0  1.472434  0.000000  0.500000
1 -0.543109  0.000000  0.500000
2  2.102813  0.000000  0.653686
3  0.403113  0.000000 -0.928956
4 -0.534830  1.170950 -3.050913
5  0.881881  0.922318 -0.715818
6 -0.682700  0.223867 -0.394087

In [20]:
#fill 默认返回新的对象，但也可对现有的对象进行修改 利用 inplace

In [22]:
_=df.fillna(0,inplace=True) 
df

          0         1         2
0  1.472434  0.000000  0.000000
1 -0.543109  0.000000  0.000000
2  2.102813  0.000000  0.653686
3  0.403113  0.000000 -0.928956
4 -0.534830  1.170950 -3.050913
5  0.881881  0.922318 -0.715818
6 -0.682700  0.223867 -0.394087

In [24]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())  #平均数填充

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [25]:
#7.2  数据转换

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
 ....: 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated() #查看重复行  第6行

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates()#去重   drop_duplicates

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data['v1'] = range(7)
data.drop_duplicates(['k1']) #根据 k1 列过滤重复项

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last') #保留最后一个出现的值

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
#利用函数或映射进行数据转换

In [37]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',  #肉类的数据
 ....: 'Pastrami', 'corned beef', 'Bacon', 
 ....: 'pastrami', 'honey ham', 'novalox'], 
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 
6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [38]:
#添加一列表示该肉类食物来源的动物类型。我们先编写一个不同肉类到动物的映射

In [41]:
meat_to_animal = { 
 'bacon': 'pig', 
 'pulled pork': 'pig', 
 'pastrami': 'cow', 
 'corned beef': 'cow', 
 'honey ham': 'pig', 
 'nova lox': 'salmon' 
}

In [42]:
lowercased = data['food'].str.lower() #转小写
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [45]:
data['animal'] = lowercased.map(meat_to_animal)  #添加一列映射 
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    cow
5        Bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8      novalox     6.0    NaN

In [49]:
#也可以传入一个能够完成全部这些工作的函数
data['food'].map(lambda x: meat_to_animal[x.lower()])

In [50]:
#替换值

In [51]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data   #-999 这个值可能是一个表示缺失数据的标记值。要将其替换为 pandas 能够理解的 NA 值  replace 来产生一个新的 Series

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace([-999, -1000], np.nan) #数据替换

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
data.replace([-999, -1000], [np.nan, 0]) #替换为不同的值

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data.replace({-999: np.nan, -1000: 0}) #或者 传入字典

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
#重命名轴索引

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
 ....: index=['Ohio', 'Colorado', 'New York'], 
 ....: columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data.index = data.index.map(transform)  #修改完
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index={'OHIO': 'INDIANA'},   # 不修改原始数据 可以用 rename
 ....: columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
#离散化和面元划分  为了便于分析，连续数据常常被离散化或拆分为“面元”（bin）

In [76]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] 
bins = [18, 25, 35, 60, 100]   #划分为“18 到 25”、“26 到 35”、“35 到 60”以及“60以上”几个面元
cats=pd.cut(ages,bins) #返回的是一个特殊的 Categorical 对象
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [78]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [79]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [80]:
pd.value_counts(cats)  #面元计数

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [81]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.15, 0.36], (0.15, 0.36], (0.78, 1.0], (0.57, 0.78], (0.78, 1.0], ..., (0.78, 1.0], (0.15, 0.36], (0.15, 0.36], (0.36, 0.57], (0.36, 0.57]]
Length: 20
Categories (4, interval[float64]): [(0.15, 0.36] < (0.36, 0.57] < (0.57, 0.78] < (0.78, 1.0]]

In [83]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-0.026, 0.622], (-0.026, 0.622], (-3.37, -0.68], (-0.026, 0.622], (0.622, 3.075], ..., (0.622, 3.075], (-0.68, -0.026], (-3.37, -0.68], (-3.37, -0.68], (0.622, 3.075]]
Length: 1000
Categories (4, interval[float64]): [(-3.37, -0.68] < (-0.68, -0.026] < (-0.026, 0.622] < (0.622, 3.075]]

In [84]:
pd.value_counts(cats)

(0.622, 3.075]     250
(-0.026, 0.622]    250
(-0.68, -0.026]    250
(-3.37, -0.68]     250
dtype: int64

In [85]:
#检测和过率异常值

In [87]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    1.499528 -0.515968  0.499119 -0.558609
1    0.266182 -0.111447  0.917686 -0.272451
2   -0.049260  0.626589  0.057236 -0.254573
3   -0.496859 -0.825122 -1.265082 -1.839595
4    0.507924  0.336631 -1.077490 -0.439763
5    1.015644  0.717397  0.288142 -0.900907
6    0.460213 -0.256587  1.517027  0.193364
7   -0.302167  1.784055 -0.989415  0.009050
8   -0.020284  2.091970 -0.102447  0.408215
9   -1.506252 -0.208396  1.730921  0.293630
10  -0.058520 -1.512806  0.314051 -1.733212
11  -1.540285  1.702601 -0.993163 -0.349630
12  -1.358060 -0.530408 -0.968570  0.247926
13  -0.987344 -1.849915 -0.144636 -1.434384
14   1.339709  2.379533 -0.655376 -0.220621
15   0.423513 -1.033903  1.537543 -0.534648
16   0.920034 -0.368653 -0.018342  0.087767
17  -0.196269  1.029953  0.998641 -0.549410
18   1.497832 -0.508135 -0.698683  0.639239
19  -0.425450 -1.835664  0.973470 -0.449677
20   0.115267  1.310095  1.096672 -2.443051
21  -0.380416  1.040856 -1.209769  0.119168
22  -0.230453 -1.037984 -0.215082 -0.148140
23  -0.060971 -0.507238  2.383960 -0.945517
24   0.184449 -0.354178  0.213828  0.464022
25  -0.854238 -0.200361  1.836775 -1.744346
26  -0.426452 -0.276298 -0.493745  1.684867
27   0.968588  1.047808  0.298467 -0.301063
28  -0.436185  0.188621  0.104502 -0.646072
29   0.028578  0.676540  1.473137  1.076199
..        ...       ...       ...       ...
970 -0.606795 -1.002347 -0.125521  0.527278
971  0.425555 -0.488931 -1.067238 -0.786787
972  0.322109 -1.509306  0.041721 -0.853279
973 -1.514516 -0.084287 -0.965369 -0.546913
974 -1.118575  0.608043 -0.437636 -0.309191
975  0.005777  0.196529  0.442529  0.506222
976 -1.744025  0.286402 -2.209218 -0.155281
977 -1.075064  0.200074  2.103120  0.008299
978 -0.070831  0.837662  0.595610 -1.170844
979  0.919453  0.006330 -1.029353 -0.597546
980 -1.060938 -0.152466 -0.278586  1.226240
981  0.479418 -0.117496  1.165916 -0.497022
982 -0.826145  1.355457  0.378705 -1.004530
983 -2.452313 -0.192375  0.528739  0.440044
984 -0.262876  0.632153 -0.402496  0.308158
985  1.349802  0.430650 -1.113458 -0.738718
986  0.072534  0.143194 -0.108719  1.010229
987 -0.293392 -0.254092  0.046923 -0.808858
988  0.857156  1.841929 -0.106681 -0.388824
989 -1.404081  0.573348 -0.109534  0.197019
990 -0.964313 -0.747173  0.477976 -0.793715
991 -1.119748 -1.951166  1.471728 -0.305169
992 -0.118071  1.304999 -0.063530  1.371849
993 -0.612016  0.901363  0.421903  0.143199
994  1.042977 -0.448474  1.134833  0.706587
995  0.913742 -0.173566 -0.956877 -0.883261
996 -0.874336 -1.800377  0.365268 -0.626768
997 -0.055322  0.334689  0.220854  0.547989
998 -1.343245  0.540279  0.830715 -0.410528
999 -0.068498  0.787143 -0.239689  0.209253

[1000 rows x 4 columns]

In [88]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016490     0.028272    -0.005504    -0.004457
std       1.004499     0.946628     0.999205     1.010633
min      -2.856491    -3.066425    -3.575319    -3.066516
25%      -0.659118    -0.561166    -0.722844    -0.662443
50%      -0.040522    -0.000817    -0.012004     0.012042
75%       0.646443     0.682217     0.685648     0.690767
max       3.422633     3.431601     3.280275     3.615399

In [89]:
data[(np.abs(data) > 3).any(1)]  #选出全部含有“超过 3 或－3 的值”的行

            0         1         2         3
151  0.914565 -0.435860 -1.270271  3.108107
163  3.020291 -0.032913 -0.203204  0.897194
388  0.126457  2.489961 -0.437141 -3.066516
491  3.422633  0.166935 -0.195404  1.660703
584 -0.582809 -2.041054  3.127092 -1.132857
589  1.423981 -0.024858 -3.575319  0.433778
634  0.435410 -3.066425 -1.439711  0.329939
639  0.034207 -0.621716 -2.382094  3.431669
699  0.448380  0.625651  3.280275 -1.313643
738 -1.013695 -0.125240 -3.411358  0.516158
851  0.238854 -0.115791  1.207056  3.615399
903 -0.046610  3.431601  0.744823 -0.406600
914  1.216848 -3.029939 -1.718816 -0.218571

In [90]:
#排列和随机取样

In [6]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [11]:
sampler= np.random.permutation(5)  #permuting，随机重排序 行排列工作
sampler

array([1, 2, 3, 4, 0])

In [12]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [13]:
 df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [14]:
 df.sample(n=3)  #选取3个随机行

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [15]:
#计算指标 哑变量

In [16]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
 .....: 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [17]:
pd.get_dummies(df['key'])  #派生 k列不同的值

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [19]:
dummies = pd.get_dummies(df['key'], prefix='key') #加个前缀
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [21]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [22]:
mnames = ['movie_id', 'title', 'genres']

In [23]:
#字符串操作

In [35]:
#以逗号分隔的字符串可以用 split 拆分成数段
val = 'a,b, guido，我是你爸爸,'
val.split(',')

['a', 'b', ' guido，我是你爸爸', '']

In [46]:
piece = [x.strip() for x in val.split(',')]  #去掉字符前空格和换行  strip 除去空白符 
piece

['a', 'b', 'guido，我是你爸爸', '']

In [48]:
first, second, third,four= pieces
first + '::' + second + '::' + third

'a::b::guido，我是你爸爸'

In [49]:
 '::'.join(pieces) #更快的方法  join

'a::b::guido，我是你爸爸::'

In [50]:
val.count(',') #指定字符串出现次数

3

In [51]:
val.replace(',', '::') #t替换

'a::b:: guido，我是你爸爸::'

In [52]:
#正则表达式

In [53]:
import re
text="foo bar\t baz \tqux"
re.split('\s+',text) #

['foo', 'bar', 'baz', 'qux']

In [55]:
regex = re.compile('\s+') #re.compile 自己编译 regex 以得到一个可重用的regex 对象：
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [56]:
regex.findall(text)

[' ', '\t ', ' \t']

In [58]:
text = """Dave dave@google.com 
Steve steve@gmail.com 
Rob rob@gmail.com 
Ryan ryan@yahoo.com 
"""
pattern =r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex=re.compile(pattern,flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [63]:
m = regex.search(text)
m   #search 返回第一个
text[m.start():m.end()]

'dave@google.com'

In [64]:
print(regex.match(text)) #regex.match 则将返回 None，因为它只匹配出现在字符串开头的模式

None

In [65]:
print(regex.sub('REDACTED', text)) #sub 方法可以将匹配到的模式替换为指定字符串，并返回所得到的新字符串：

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [66]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' #将各个地址分成 3 个部分：用户名、域名以及域后缀。要实现此功能，只需将待分段的模式的各部分用圆括号包
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [67]:
#[pandas 矢量化字符串数组]

In [70]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 
 .....: 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [71]:
data.str.contains('gmail') #查看是否含有gmail

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [73]:
 matches = data.str.match(pattern, flags=re.IGNORECASE)
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64